import numpy as np

M = 10**5 #А/м
R = 0.01 #м
L = 0.1 #м
const = 4*np.pi*(10**(-7))
p = 1000 #магнитная проницаемость железа
print("Введите число разбиения цилиндра")
n = int(input())
print("Введите число разбиения элементарного кольца на элементы с током")
k = int(input())
F = 0
j = 0
c=1
while (j <= ((n-1)/2)):
    i=1
    while (i <= ((n-1)/2)):
        c=1
        while (c <= k):
            F+=2*(const*(((M*(L/n))*((2*np.pi*R)/(k)))**2)*(((L/n)*((n-1)/2))+((L/n)*i)-((L/n)*j)))/(4*np.pi*(((L/n)*((n-1)/2))+((L/n)*i)-((L/n)*j))**3)
            #F+=(3*const*((M*(np.pi)*(R**2)*(L/n))**2))/(2*(np.pi)*(((R**2)+(((L/n)*((n-1)/2))+((L/n)*i)-((L/n)*j))**2)**(3/2))*(((L/n)*((n-1)/2))+((L/n)*i)-((L/n)*j)))
            #(((L/n)*((n-1)/2))+((L/n)*i)-((L/n)*j)) ---z
            c+=1
        i+=1
    j+=1
print(F)
